In [1]:
import os
import numpy as np
import pandas as pd
import csv
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm
import statsmodels.formula.api as smf
from sklearn import linear_model, feature_selection, neighbors, metrics, grid_search, cross_validation


%matplotlib inline
plt.style.use('ggplot')

pd.set_option('display.max_rows', 10)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

In [6]:
df_raw = pd.read_csv(os.path.join('..', 'CODE', 'speed-dating-experiment', 'Speed Dating Data.csv'))

df_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8378 entries, 0 to 8377
Columns: 195 entries, iid to amb5_3
dtypes: float64(174), int64(13), object(8)
memory usage: 12.5+ MB

In [7]:
df_raw.columns

Index([u'iid', u'id', u'gender', u'idg', u'condtn', u'wave', u'round',
       u'position', u'positin1', u'order',
       ...
       u'attr3_3', u'sinc3_3', u'intel3_3', u'fun3_3', u'amb3_3', u'attr5_3',
       u'sinc5_3', u'intel5_3', u'fun5_3', u'amb5_3'],
      dtype='object', length=195)

In [9]:
df_raw

,iid,id,gender,idg,condtn,...,attr5_3,sinc5_3,intel5_3,fun5_3,amb5_3
0,1,1.0,0,1,1,...,NaN,NaN,NaN,NaN,NaN
1,1,1.0,0,1,1,...,NaN,NaN,NaN,NaN,NaN
2,1,1.0,0,1,1,...,NaN,NaN,NaN,NaN,NaN
3,1,1.0,0,1,1,...,NaN,NaN,NaN,NaN,NaN
4,1,1.0,0,1,1,...,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
8373,552,22.0,1,44,2,...,9.0,5.0,9.0,5.0,6.0
8374,552,22.0,1,44,2,...,9.0,5.0,9.0,5.0,6.0
8375,552,22.0,1,44,2,...,9.0,5.0,9.0,5.0,6.0
8376,552,22.0,1,44,2,...,9.0,5.0,9.0,5.0,6.0
8377,552,NaN,1,44,2,...,9.0,5.0,9.0,5.0,6.0

*******

## Creating New Dataset with Desired Columns

In [12]:
subset_df = df_raw[['iid', 'gender', 'round', 'wave','pid', 
                    'samerace', 'imprace', 'imprelig', 
                    'age', 'age_o', 
                    'match', 'dec', 'dec_o', 'condtn', 
                    'exphappy', 'expnum', 'goal', 'match_es', 
                    'like', 'prob', 'like_o', 'prob_o', 
                    'attr', 'sinc', 'intel', 'fun', 'amb', 'shar', 
                    'attr_o', 'sinc_o', 'intel_o', 'fun_o','amb_o','shar_o', 
                    'attr3_1', 'sinc3_1', 'fun3_1', 'intel3_1', 'amb3_1', 
                    'attr3_2', 'sinc3_2', 'fun3_2', 'intel3_2', 'amb3_2', 
                    'attr5_1', 'sinc5_1', 'intel5_1', 'fun5_1', 'amb5_1', 
                    'attr5_2', 'sinc5_2', 'intel5_2', 'fun5_2', 'amb5_2', 
                    'attr3_s', 'sinc3_s', 'intel3_s', 'fun3_s', 'amb3_s', 
                    'attr1_1', 'sinc1_1', 'fun1_1', 'intel1_1', 'amb1_1', 'shar1_1', 
                    'attr1_2', 'sinc1_2', 'fun1_2', 'intel1_2', 'amb1_2', 'shar1_2', 
                    'pf_o_att','pf_o_sin', 'pf_o_int', 'pf_o_fun', 'pf_o_amb', 'pf_o_sha', 
                    'attr1_s', 'sinc1_s', 'fun1_s', 'intel1_s', 'amb1_s', 'shar1_s', 
                    'attr7_2', 'sinc7_2', 'fun7_2', 'intel7_2', 'amb7_2', 'shar7_2', 
                    'attr4_1', 'sinc4_1', 'fun4_1', 'intel4_1', 'amb4_1', 'shar4_1', 
                    'attr4_2', 'sinc4_2', 'fun4_2', 'intel4_2', 'amb4_2', 'shar4_2', 
                    'attr2_1', 'sinc2_1', 'fun2_1', 'intel2_1', 'amb2_1', 'shar2_1', 
                    'attr2_2', 'sinc2_2', 'fun2_2', 'intel2_2', 'amb2_2', 'shar2_2']]

subset_df

,iid,gender,round,wave,pid,...,sinc2_2,fun2_2,intel2_2,amb2_2,shar2_2
0,1,0,10,1,11.0,...,NaN,NaN,NaN,NaN,NaN
1,1,0,10,1,12.0,...,NaN,NaN,NaN,NaN,NaN
2,1,0,10,1,13.0,...,NaN,NaN,NaN,NaN,NaN
3,1,0,10,1,14.0,...,NaN,NaN,NaN,NaN,NaN
4,1,0,10,1,15.0,...,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
8373,552,1,22,21,526.0,...,5.0,20.0,10.0,5.0,10.0
8374,552,1,22,21,527.0,...,5.0,20.0,10.0,5.0,10.0
8375,552,1,22,21,528.0,...,5.0,20.0,10.0,5.0,10.0
8376,552,1,22,21,529.0,...,5.0,20.0,10.0,5.0,10.0
8377,552,1,22,21,530.0,...,5.0,20.0,10.0,5.0,10.0

In [14]:
subset_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8378 entries, 0 to 8377
Columns: 113 entries, iid to shar2_2
dtypes: float64(104), int64(9)
memory usage: 7.2 MB

### Renaming Features:

In [34]:
#rename 'Round' to 'met_count' 

subset_df.rename(columns={'round': 'met_count'}, inplace = True)

/Users/Miranda/anaconda2/lib/python2.7/site-packages/pandas/core/frame.py:2748: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  **kwargs)

In [36]:
subset_df['met_count']

0       10
1       10
2       10
3       10
4       10
        ..
8373    22
8374    22
8375    22
8376    22
8377    22
Name: met_count, dtype: int64

### Feature Info:

******

### Seperating Dataset into Two datasets: 1 Female; 1 Male

In [37]:
df_female_raw = subset_df[subset_df.gender == 0]
df_female_raw

,iid,gender,met_count,wave,pid,...,sinc2_2,fun2_2,intel2_2,amb2_2,shar2_2
0,1,0,10,1,11.0,...,NaN,NaN,NaN,NaN,NaN
1,1,0,10,1,12.0,...,NaN,NaN,NaN,NaN,NaN
2,1,0,10,1,13.0,...,NaN,NaN,NaN,NaN,NaN
3,1,0,10,1,14.0,...,NaN,NaN,NaN,NaN,NaN
4,1,0,10,1,15.0,...,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
7889,530,0,22,21,548.0,...,20.0,15.0,10.0,10.0,15.0
7890,530,0,22,21,549.0,...,20.0,15.0,10.0,10.0,15.0
7891,530,0,22,21,550.0,...,20.0,15.0,10.0,10.0,15.0
7892,530,0,22,21,551.0,...,20.0,15.0,10.0,10.0,15.0
7893,530,0,22,21,552.0,...,20.0,15.0,10.0,10.0,15.0

In [38]:
df_male_raw = subset_df[subset_df.gender == 1]
df_male_raw

,iid,gender,met_count,wave,pid,...,sinc2_2,fun2_2,intel2_2,amb2_2,shar2_2
100,11,1,10,1,1.0,...,NaN,NaN,NaN,NaN,NaN
101,11,1,10,1,2.0,...,NaN,NaN,NaN,NaN,NaN
102,11,1,10,1,3.0,...,NaN,NaN,NaN,NaN,NaN
103,11,1,10,1,4.0,...,NaN,NaN,NaN,NaN,NaN
104,11,1,10,1,5.0,...,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
8373,552,1,22,21,526.0,...,5.0,20.0,10.0,5.0,10.0
8374,552,1,22,21,527.0,...,5.0,20.0,10.0,5.0,10.0
8375,552,1,22,21,528.0,...,5.0,20.0,10.0,5.0,10.0
8376,552,1,22,21,529.0,...,5.0,20.0,10.0,5.0,10.0
8377,552,1,22,21,530.0,...,5.0,20.0,10.0,5.0,10.0

# Compress Features Within Dataset to Get Averages & Sums

### Function for Sums:

In [39]:
def getSum(feature, df):
    for iid in range(len(df)):
        sum = df.groupby(['iid'])[feature].sum()
        return sum

### Function to Get Averages of a Feature Set:

In [43]:
def getAve(feature, divs, df):
    for iid in range(len(df)):
        ave = df.groupby(['iid'])[[feature, divs]].mean()
        return ave

#divs = denominator ##RENAME

### Function to Grab 1 Row of Data:

In [94]:
def getValueSet(feature, df):
    for iid in range(len(df)):
        denom = df.groupby(['iid'])[feature].value_counts()
        sum = df.groupby(['iid'])[feature].sum()
        divis = sum/denom
        return divis

In [91]:
## Test part of formula

df_male_raw.groupby(['iid'])['gender'].value_counts()

iid  gender
11   1         10
12   1         10
13   1         10
14   1         10
15   1         10
               ..
548  1         22
549  1         22
550  1         22
551  1         22
552  1         22
dtype: int64

In [97]:
gender = getValueSet('gender', df_male_raw)

gender

iid  gender
11   1         1.0
12   1         1.0
13   1         1.0
14   1         1.0
15   1         1.0
              ...
548  1         1.0
549  1         1.0
550  1         1.0
551  1         1.0
552  1         1.0
dtype: float64

In [98]:
match_es = getValueSet('match_es', df_male_raw)

match_es

iid  match_es
11   0.0         0.0
12   3.0         3.0
16   3.0         3.0
17   1.0         1.0
18   2.0         2.0
                ...
548  5.0         5.0
549  3.0         3.0
550  6.0         6.0
551  3.0         3.0
552  3.0         3.0
dtype: float64

In [114]:
f_match_es = getValueSet('match_es', df_female_raw)

f_match_es

iid  match_es
1    4.0         4.0
2    3.0         3.0
4    2.0         2.0
6    4.0         4.0
7    2.0         2.0
                ...
526  2.0         2.0
527  0.0         0.0
528  2.0         2.0
529  4.0         4.0
530  6.0         6.0
dtype: float64

### index sort before adding data

In [ ]:
data.set_index(['index_column'], inplace=True)
"if index is unsorted, assignment of a new column will fail"        
data.sort_index(inplace = True)
data.loc['index_value1', 'column_y'] = np.random.randn(data.loc['index_value1', 'column_x'].shape[0])

In [ ]:
df_1 = df[df.SalePriceUnit == '$']

df_1 = df_1.drop('SalePriceUnit', axis = 1)
# Really a workaround as DataFrame.drop() with inplace = True issue warnings...

df_6 = df[df.SalePriceUnit == '$M']

df_6 = df_6.drop('SalePriceUnit', axis = 1)

# Replacing the content of a column
df_6.SalePrice = df_6.SalePrice * (10 ** 6)

# Adding rows to a DataFrame
# Concatenation of two DataFrame objects
df = pd.concat([df_1, df_6])

In [115]:
df_female_raw['match_es'] = match_es


df['SalesBinary'] = df.SalesCategory.map({'Low' : 0, 'High' : 1})

TypeError: incompatible index of inserted column with frame index

In [100]:
f_match_es_ave = getAve('match_es', 'met_count', df_female_raw)
f_match_es_ave

     match_es  met_count
iid
1         4.0         10
2         3.0         10
3         NaN         10
4         2.0         10
5         NaN         10
..        ...        ...
526       2.0         22
527       0.0         22
528       2.0         22
529       4.0         22
530       6.0         22

[274 rows x 2 columns]

### *Female Dataset*

>**Sum of Matches:**

In [40]:
#Sum of MATCHES for each woman

f_match_sum = getSum('match',df_female_raw)
f_match_sum

iid
1      4
2      2
3      0
4      2
5      2
      ..
526    2
527    0
528    0
529    2
530    2
Name: match, dtype: int64

**'Yes' Sum (#of decision = yes):**

In [47]:
#Sum of each woman's decisions ('yes')

f_dec_sum = getSum('dec',df_female_raw)
type(f_dec_sum)

pandas.core.series.Series

**dec_o sum = sum of 'yes' per men for women**:

In [42]:
#Sum of decisions of men('yes') for each woman 

f_dec_o_sum = getSum('dec_o',df_female_raw)
f_dec_o_sum

iid
1      5
2      6
3      5
4      6
5      3
      ..
526    3
527    3
528    5
529    3
530    3
Name: dec_o, dtype: int64

### *Male Dataset*

#### **Ave of attr_o**:

In [48]:
m_attr_o_ave = getAve('attr_o', 'met_count', df_male_raw)

type(m_attr_o_ave)

pandas.core.frame.DataFrame

In [ ]:
m_attr_o_ave = getAve('attr_o', 'met_count', df_male_raw)

## Set index to iid

In [ ]:
df = df.set_index('iid')

## drop outliers? drop nan values? (for each compressed feature)?

EG:
    

len(subset_df.match_es)

len(subset_df.match_es.dropna())

subset_df.match_es.dropna(inplace = True) #removing NaN values

len(subset_df.match_es)

EG:

Q1 = df.Newspaper.quantile(0.25)
Q3 = df.Newspaper.quantile(0.75)

IQR = Q3 - Q1

IQR


df.drop(df[df.Newspaper > Q3 + 1.5 * IQR].index, inplace = True)

len(df)